package genshin

import (
	"activity-bot/internal/predicate"
)

var Categories = []Category{
	Mondstadt,
	Liyue,
	Inazuma,
	Sumeru,
	Fontaine,
	Natlan,
	NodKrai,
	Snezhnaya,
	Fatui,
	Other,
}

func FindRole(name string) (Category, Role, bool) {
	name = predicate.NormalizeTag(name)

	for i := range Categories {
		category := Categories[i]

		for j := range category.Roles {
			role := category.Roles[j]

			if predicate.NormalizeTag(role.Name) == name {
				return category, role, true
			}

			for _, alias := range role.Aliases {
				if predicate.NormalizeTag(alias) == name {
					return category, role, true
				}
			}
		}
	}

	return Category{}, Role{}, false
}

//var Categories = []Category{
//	{
//		Name:  "Мондштадт",
//		Emoji: `<tg-emoji emoji-id="5330195937803387184">🌪</tg-emoji>`,
//		Roles: []string{
//			"Алиса",
//			"Альбедо",
//			"Барбара",
//			"Беннет",
//			"Варка",
//			"Венти",
//			"Далия",
//			"Джин",
//			"Дилюк",
//			"Диона",
//			"Дурин",
//			"Кли",
//			"Кэйа",
//			"Лиза",
//			"Лоэн",
//			"Мика",
//			"Мона",
//			"Ноэль",
//			"Розария",
//			"Рэйзор",
//			"Сахароза",
//			"Фишль",
//			"Эмбер",
//			"Эола",
//			"Прюн",
//		},
//	},
//
//	{
//		Name:  "Ли Юэ",
//		Emoji: `<tg-emoji emoji-id="5330309058652029778">🪨</tg-emoji>`,
//		Roles: []string{
//			"Бай Чжу",
//			"Бэй Доу",
//			"Гань Юй",
//			"Е Лань",
//			"Ка Мин",
//			"Кэ Цин",
//			"Лань Янь",
//			"Нин Гуан",
//			"Син Цю",
//			"Синь Янь",
//			"Сян Лин",
//			"Сянь Юнь",
//			"Сяо",
//			"Ху Тао",
//			"Цзы Бай",
//			"Чича",
//			"Чжун Ли",
//			"Чун Юнь",
//			"Шэнь Хэ",
//			"Юнь Цзинь",
//			"Янь Фэй",
//			"Яо Яо",
//		},
//	},
//
//	{
//		Name:  "Инадзума",
//		Emoji: `<tg-emoji emoji-id="5328056623183184424">⚡️</tg-emoji>`,
//		Roles: []string{
//			"Аяка",
//			"Аято",
//			"Горо",
//			"Ёимия",
//			"Итто",
//			"Кадзуха",
//			"Кирара",
//			"Кокоми",
//			"Мидзуки",
//			"Райден",
//			"Эи",
//			"Сара",
//			"Саю",
//			"Синобу",
//			"Тома",
//			"Хэйдзо",
//			"Яэ Мико",
//		},
//	},
//
//	{
//		Name:  "Сумеру",
//		Emoji: `<tg-emoji emoji-id="5328290823454867098">🌿</tg-emoji>`,
//		Roles: []string{
//			"Хайтам",
//			"Дори",
//			"Дэхья",
//			"Кавех",
//			"Кандакия",
//			"Коллеи",
//			"Лайла",
//			"Нахида",
//			"Нефер",
//			"Нилу",
//			"Сайно",
//			"Сетос",
//			"Странник",
//			"Тигнари",
//			"Фарузан",
//		},
//	},
//
//	{
//		Name:  "Фонтейн",
//		Emoji: `<tg-emoji emoji-id="5327827576872254854">💦</tg-emoji>`,
//		Roles: []string{
//			"Клоринда",
//			"Линнет",
//			"Лини",
//			"Невиллет",
//			"Навия",
//			"Ризли",
//			"Сиджвин",
//			"Тиори",
//			"Фокалорс",
//			"Фурина",
//			"Фремине",
//			"Шарлотта",
//			"Шеврёз",
//			"Эмилия",
//			"Эскофье",
//		},
//	},
//
//	{
//		Name:  "Натлан",
//		Emoji: `<tg-emoji emoji-id="5242738760000492993">🔥</tg-emoji>`,
//		Roles: []string{
//			"Вареса",
//			"Иансан",
//			"Ифа",
//			"Качина",
//			"Кинич",
//			"Мавуика",
//			"Муалани",
//			"Оророн",
//			"Ситлали",
//			"Часка",
//			"Шилонен",
//		},
//	},
//
//	{
//		Name:  "Нод Край",
//		Emoji: `<tg-emoji emoji-id="5377354992246091279">🇬🇧</tg-emoji>`,
//		Roles: []string{
//			"Айно",
//			"Иллуги",
//			"Инеффа",
//			"Лаума",
//			"Линнея",
//			"Нефер",
//			"Флинс",
//			"Ягода",
//		},
//	},
//
//	{
//		Name:  "Снежная",
//		Emoji: `<tg-emoji emoji-id="5262510246810658941">❄️</tg-emoji>`,
//		Roles: []string{
//			"Алеша",
//			"Валерий",
//			"Весна",
//			"Водяница",
//			"Даника",
//			"Митя",
//			"Ной",
//			"Одетта",
//			"Царица",
//		},
//	},
//
//	{
//		Name:  "Фатуи",
//		Emoji: `<tg-emoji emoji-id="5377325412806309208">🧩</tg-emoji>`,
//		Roles: []string{
//			"Пьеро",
//			"Капитано",
//			"Дотторе",
//			"Коломбина",
//			"Арлекино",
//			"Пульчинелла",
//			"Сандроне",
//			"Тарталья",
//			"Панталоне",
//			"Скара",
//			"Синьора",
//		},
//	},
//
//	{
//		Name:  "Другое",
//		Emoji: "❔",
//		Roles: []string{
//			"Дайнслейф",
//			"Итер",
//			"Люмин",
//			"Ведрфельнир",
//			"Скирк",
//			"Николь",
//		},
//	},
//}
